### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-auth-lambda"
!       last_modified                  = "2023-08-08T21:23:13.000+0000" -> (known after apply)
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:3",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:3" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:3/invocations" -> (known after apply)
!       s3_key                         = "lambda-builds/ef3c3c151405726a9b0dc24b91f812bcdc36e6dcce279b778cebe3d9d8675987.zip" -> "lambda-builds/6d247047ed89d743486398ea58aa9a9f78729a5fd1108ce255ef1869fb97a7a5.zip"
!       s3_object_version              = "null" -> (known after apply)
        tags                           = {}
!       version                        = "3" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "3" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "1f60f60f1a70f47b7f1d362c2430430e" -> (known after apply)
!       id                     = "lambda-builds/ef3c3c151405726a9b0dc24b91f812bcdc36e6dcce279b778cebe3d9d8675987.zip" -> (known after apply)
!       key                    = "lambda-builds/ef3c3c151405726a9b0dc24b91f812bcdc36e6dcce279b778cebe3d9d8675987.zip" -> "lambda-builds/6d247047ed89d743486398ea58aa9a9f78729a5fd1108ce255ef1869fb97a7a5.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "./.terraform/lambda-builds/ef3c3c151405726a9b0dc24b91f812bcdc36e6dcce279b778cebe3d9d8675987.zip" -> "./.terraform/lambda-builds/6d247047ed89d743486398ea58aa9a9f78729a5fd1108ce255ef1869fb97a7a5.zip"
-       tags                   = {} -> null
!       tags_all               = {} -> (known after apply)
!       version_id             = "null" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "./.terraform/lambda-builds/"
+               build_plan    = [
+                   [
+                       "set:filter",
+                       [
+                           "!dist/",
                        ],
                    ],
+                   [
+                       "zip",
+                       "./",
+                       null,
                    ],
+                   [
+                       "clear:filter",
                    ],
                ]
+               filename      = "./.terraform/lambda-builds/6d247047ed89d743486398ea58aa9a9f78729a5fd1108ce255ef1869fb97a7a5.zip"
+               runtime       = "python3.10"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "./.terraform/lambda-builds/6d247047ed89d743486398ea58aa9a9f78729a5fd1108ce255ef1869fb97a7a5.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "9091320492089417654" -> (known after apply)
!       triggers = {
!           "filename"  = "./.terraform/lambda-builds/ef3c3c151405726a9b0dc24b91f812bcdc36e6dcce279b778cebe3d9d8675987.zip" -> "./.terraform/lambda-builds/6d247047ed89d743486398ea58aa9a9f78729a5fd1108ce255ef1869fb97a7a5.zip"
!           "timestamp" = "1691529717401541000" -> "1691532682232919000"
        }
    }

  # module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
!       id       = "1766051944706351559" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "./.terraform/lambda-builds/ef3c3c151405726a9b0dc24b91f812bcdc36e6dcce279b778cebe3d9d8675987.zip" -> "./.terraform/lambda-builds/6d247047ed89d743486398ea58aa9a9f78729a5fd1108ce255ef1869fb97a7a5.zip"
!           "original_source_code" = "\"./main.py\"" -> jsonencode(
                [
+                   {
+                       path             = "./"
+                       patterns         = [
+                           "!dist/",
                        ]
+                       pip_requirements = false
                    },
                ]
            )
            # (3 unchanged elements hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:3" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-08T21:22:58.251+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:3" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3" -> (known after apply)
!       s3_key                      = "builds/f58dc77728d1f77b63a1e1f8b408281adb39a0f33fcef2836a8fca4ab729444e.zip" -> "builds/2fd7e491df75413fce5c84dcaec3fe13a61efa2d04007a1f586ca9d5d3df7248.zip"
!       s3_object_version           = "lk9lcEr.iNGoowfaPdwDSSbmXAiOSvhI" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "2Fpj5zHVNIAUNHfXDtQuPjhNAwfk0tLilLIcXWclDEI=" -> (known after apply)
!       source_code_size            = 26187391 -> (known after apply)
!       version                     = "3" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "ac38337111c879666762aad6ed827bf6-5" -> (known after apply)
!       id                     = "builds/f58dc77728d1f77b63a1e1f8b408281adb39a0f33fcef2836a8fca4ab729444e.zip" -> (known after apply)
!       key                    = "builds/f58dc77728d1f77b63a1e1f8b408281adb39a0f33fcef2836a8fca4ab729444e.zip" -> "builds/2fd7e491df75413fce5c84dcaec3fe13a61efa2d04007a1f586ca9d5d3df7248.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/f58dc77728d1f77b63a1e1f8b408281adb39a0f33fcef2836a8fca4ab729444e.zip" -> "builds/2fd7e491df75413fce5c84dcaec3fe13a61efa2d04007a1f586ca9d5d3df7248.zip"
-       tags                   = {} -> null
!       tags_all               = {} -> (known after apply)
!       version_id             = "lk9lcEr.iNGoowfaPdwDSSbmXAiOSvhI" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "./dist.zip",
+                       null,
                    ],
                ]
+               filename      = "builds/2fd7e491df75413fce5c84dcaec3fe13a61efa2d04007a1f586ca9d5d3df7248.zip"
+               runtime       = ""
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/2fd7e491df75413fce5c84dcaec3fe13a61efa2d04007a1f586ca9d5d3df7248.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "5381373513563238332" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/f58dc77728d1f77b63a1e1f8b408281adb39a0f33fcef2836a8fca4ab729444e.zip" -> "builds/2fd7e491df75413fce5c84dcaec3fe13a61efa2d04007a1f586ca9d5d3df7248.zip"
!           "timestamp" = "1691529719004821000" -> "1691532666444360000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "7841644402350571227" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/f58dc77728d1f77b63a1e1f8b408281adb39a0f33fcef2836a8fca4ab729444e.zip" -> "builds/2fd7e491df75413fce5c84dcaec3fe13a61efa2d04007a1f586ca9d5d3df7248.zip"
!           "original_source_code" = "\"./dist\"" -> jsonencode(
                [
+                   {
+                       path             = "./dist.zip"
+                       pip_requirements = false
                    },
                ]
            )
            # (3 unchanged elements hidden)
        }
    }

Plan: 10 to add, 1 to change, 8 to destroy.
```
</details>